# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp = pd.read_csv("Temp_States.csv")

In [37]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [43]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [6]:
"""
temp is composed of 2 object columns and 1 float column
"""

'\nTemp is composed of 2 object columns and 1 float column\n'

#### Select the rows where state is New York.

In [13]:
# your code here
ny = temp.loc[temp['State'] == 'New York']
ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [16]:
# your code here
print('the average temperature of cities in New York is :', ny['Temperature'].mean())

the average temperature of cities in New York is : 10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [19]:
# your code here
above_15 = temp.loc[temp['Temperature'] > 15]
above_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [22]:
# your code here
print('the cities with Temperature above 15 are: ')
list(above_15["City"])

the cities with Temperature above 15 are:

['NYC', 'Hartford', 'Treton', 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [32]:
# your code here

temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]["City"]

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [36]:
# your code here
temp.groupby("State").agg({"Temperature":["mean","std"]})

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [39]:
# your code here
employees = pd.read_csv("Employees.csv")
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

#### Explore the data types of the `employees` dataframe. Comment your results.

In [42]:
# your code here
employees.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
the data types seems coherent 
"""

#### What's the average salary in this company?

In [44]:
# your code here
print('the average salary in this company is :', employees['Salary'].mean())

the average salary in this company is : 73.528

#### What's the highest salary?

In [45]:
# your code here
print('the highest salary in this company is :', employees['Salary'].max())

the highest salary in this company is : 120

#### What's the lowest salary?

In [47]:
# your code here
lowest_salary = employees['Salary'].min()
print('the lowest salary in this company is :', lowest_salary)

the lowest salary in this company is : 30

#### Who are the employees with the lowest salary?

In [50]:
# your code here
employees[(employees['Salary'] == lowest_salary)]['Name']

27         Sean
106        Luke
128        Adam
139        Rick
214        Neil
266      Marcel
452    Augustin
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [55]:
# your code here
David = employees[(employees['Name'] == "David")]
David

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [56]:
# your code here
David['Salary']

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [57]:
# your code here
associate = employees[(employees['Title'] == "associate")]
David

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [58]:
# Method 1
# your code here
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [60]:
# Method 2
# your code here
employees[:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [61]:
# your code here
employees[(employees['Salary'] > 55) & (employees['Title'] == 'associate')]["Name"]

0         David
9        Kareem
10      Cynthia
16       Shanon
18        Megan
         ...
476        Greg
477     Phillip
486         Jay
487    Patricia
494     Vanessa
Name: Name, Length: 104, dtype: object

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [63]:
# your code here
employees.groupby("Years").agg({"Salary":"mean"})

          Salary
Years
1      75.863636
2      75.857143
3      74.571429
4      77.129032
5      73.857143
6      72.382353
7      73.840000
8      64.250000
9      76.741935
10     73.351351
11     74.866667
12     73.454545
13     71.935484
14     70.968750
15     69.758621

####  What is the average salary per title?

In [64]:
# your code here
employees.groupby("Title").agg({"Salary":"mean"})

              Salary
Title
Analyst    73.703911
VP         72.907975
associate  73.968354

####  Find the salary quartiles.

In [65]:
# your code here
quartiles = employees['Salary'].quantile([0.25, 0.5, 0.75])
print("Quartiles: \n", quartiles)

Quartiles:
 0.25    50.0
0.50    72.0
0.75    97.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [79]:
# your code here
employees.head(1)
employees['Name'].unique

<bound method Series.unique of 0         David
1        Thomas
2         Diana
3      Manuella
4         Carla
         ...
495      Calvin
496      Dustin
497     Winston
498        Earl
499       Alvin
Name: Name, Length: 500, dtype: object>

In [74]:
! pip install gender_detector
from gender_detector import GenderDetector

Requirement already satisfied: gender_detector in c:\users\rachad\anaconda3\lib\site-packages (0.1.0)

ImportError: cannot import name 'GenderDetector' from 'gender_detector' (C:\Users\Rachad\anaconda3\lib\site-packages\gender_detector\__init__.py)

In [ ]:
#detector = GenderDetector('us') # It can also be ar, uk, uy.
detector.guess('Marcos') # => 'male'

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [80]:
# your code 
employees.groupby('Department').agg(['max',"min", 'mean'])

C:\Users\Rachad\AppData\Local\Temp\ipykernel_17196\4201100767.py:2: FutureWarning: ['Education', 'Title', 'Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  employees.groupby('Department').agg(['max',"min", 'mean'])

           Years               Salary
             max min      mean    max min       mean
Department
Admin         15   1  7.642276    120  30  76.325203
HR            15   1  7.172131    119  30  74.237705
IT            15   1  8.141791    120  30  70.671642
Sales         15   1  7.206612    120  30  73.132231

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [87]:
# your code here
employees.groupby('Department')['Salary'].apply(lambda x: x.max() - x.min())

Department
Admin    90
HR       89
IT       90
Sales    90
Name: Salary, dtype: int64

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [93]:
# your code here
orders = pd.read_csv("Orders - Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 8:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 8:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [90]:
# your code here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [92]:
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

In [ ]:
"""

We can notice that the amount_spent, Quantity and UnitPrice have high stds compared to the means. Which indicates some outliers
"""

####  What is the average purchase price?

In [95]:
# your code here
print('the average purchase price :', orders['UnitPrice'].mean())

the average purchase price : 3.116174480549152

#### What are the highest and lowest purchase prices?

In [96]:
# your code here
print('the highest purchase price :', orders['UnitPrice'].max())
print('')
print('the lowest purchase price :', orders['UnitPrice'].min())

the highest purchase price : 8142.75

the lowest purchase price : 0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [101]:
#First figure out how spain is written in the column
orders['Country'].unique()

array(['United Kingdom', 'France', 'Australia', 'Netherlands', 'Germany',
       'Norway', 'EIRE', 'Switzerland', 'Spain', 'Poland', 'Portugal',
       'Italy', 'Belgium', 'Lithuania', 'Japan', 'Iceland',
       'Channel Islands', 'Denmark', 'Cyprus', 'Sweden', 'Finland',
       'Austria', 'Greece', 'Singapore', 'Lebanon',
       'United Arab Emirates', 'Israel', 'Saudi Arabia', 'Czech Republic',
       'Canada', 'Unspecified', 'Brazil', 'USA', 'European Community',
       'Bahrain', 'Malta', 'RSA'], dtype=object)

In [103]:
# To identify unique customers from Spain
orders[orders['Country'] == "Spain"]["CustomerID"].unique()

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442], dtype=int64)

#### How many customers do we have in Spain?

In [115]:
# your code here
spain = orders[orders['Country'] == "Spain"]["CustomerID"].unique()
lst = list(spain)
print("Number of customers in spain is: ", len(lst))

Number of customers in spain is:  30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [148]:
# your code here
customers_items = orders.groupby('CustomerID').agg({'StockCode':'count'})
customers_50 = customers_items[customers_items['StockCode'] > 50]
print(customers_50)
print('')
print("The list of unique customers who have bought more than 50 items is: ",  list(customers_50["StockCode"]))

            StockCode
CustomerID
12347             182
12349              73
12352              85
12354              58
12356              59
...               ...
18260             134
18263              61
18272             166
18283             756
18287              70

[1908 rows x 1 columns]

The list of unique customers who have bought more than 50 items is:  [182, 73, 85, 58, 59, 131, 248, 129, 266, 85, 167, 63, 52, 77, 219, 104, 87, 99, 100, 100, 64, 156, 126, 85, 59, 54, 105, 77, 105, 109, 61, 716, 192, 125, 294, 97, 236, 108, 420, 200, 98, 177, 58, 191, 354, 90, 125, 63, 62, 83, 460, 339, 168, 424, 233, 300, 154, 217, 75, 346, 55, 245, 77, 61, 149, 147, 69, 51, 284, 124, 152, 106, 144, 71, 92, 66, 63, 261, 273, 478, 52, 69, 57, 191, 121, 105, 168, 446, 188, 60, 88, 147, 114, 247, 96, 87, 68, 118, 206, 132, 62, 64, 101, 60, 106, 65, 153, 105, 90, 92, 467, 86, 294, 230, 64, 101, 101, 390, 53, 73, 122, 126, 230, 161, 101, 92, 83, 165, 52, 638, 525, 344, 105, 157, 171, 72, 268, 53, 88, 334, 157, 208, 77, 133, 259, 69, 55, 354, 161, 53, 69, 53, 124, 139, 274, 134, 222, 103, 4596, 199, 53, 197, 63, 371, 97, 95, 69, 310, 55, 66, 149, 103, 84, 59, 59, 91, 56, 175, 123, 314, 113, 420, 103, 52, 91, 51, 78, 110, 314, 95, 538, 107, 66, 85, 154, 71, 82, 82, 116, 72, 63, 91, 75, 107, 720, 84, 82, 106, 129, 62, 120, 99, 75, 97, 116, 215, 63, 79, 180, 238, 95, 109, 151, 305, 76, 92, 64, 61, 59, 339, 404, 89, 219, 110, 176, 458, 131, 99, 71, 172, 136, 403, 76, 69, 425, 112, 358, 1028, 73, 1818, 155, 159, 423, 572, 304, 58, 145, 201, 120, 76, 79, 55, 235, 140, 98, 127, 704, 63, 170, 135, 319, 86, 74, 85, 87, 79, 121, 79, 65, 131, 314, 72, 265, 94, 181, 79, 63, 110, 226, 119, 57, 149, 321, 56, 142, 90, 66, 108, 611, 207, 58, 67, 58, 141, 87, 1677, 91, 187, 211, 440, 316, 96, 85, 187, 54, 59, 81, 81, 54, 107, 72, 78, 62, 87, 124, 476, 106, 75, 108, 53, 268, 51, 54, 134, 119, 51, 90, 166, 60, 128, 158, 53, 97, 172, 152, 51, 155, 478, 304, 104, 127, 78, 157, 74, 67, 101, 167, 54, 59, 195, 71, 443, 63, 382, 99, 302, 260, 64, 86, 58, 79, 109, 69, 422, 86, 65, 52, 215, 162, 115, 59, 141, 93, 436, 172, 223, 66, 76, 296, 179, 87, 98, 124, 51, 109, 136, 175, 82, 83, 176, 85, 341, 126, 83, 53, 174, 87, 58, 128, 166, 247, 99, 98, 226, 74, 201, 81, 92, 59, 71, 146, 188, 62, 63, 101, 66, 146, 79, 96, 63, 166, 56, 108, 104, 53, 87, 470, 65, 195, 57, 53, 568, 90, 197, 134, 51, 336, 105, 102, 60, 85, 104, 63, 196, 191, 321, 72, 76, 342, 142, 117, 57, 70, 208, 368, 135, 119, 177, 197, 57, 115, 349, 60, 137, 76, 69, 57, 176, 59, 96, 93, 74, 55, 174, 206, 55, 101, 93, 81, 110, 76, 139, 61, 307, 115, 336, 104, 165, 178, 65, 142, 59, 110, 118, 149, 122, 148, 117, 58, 160, 137, 152, 92, 626, 149, 338, 54, 111, 107, 351, 234, 84, 121, 155, 86, 208, 171, 84, 161, 66, 243, 250, 143, 89, 66, 92, 235, 209, 85, 488, 54, 210, 56, 1106, 284, 202, 111, 80, 52, 324, 65, 153, 181, 450, 69, 589, 214, 105, 5111, 250, 79, 74, 123, 156, 160, 72, 159, 167, 52, 67, 200, 134, 66, 210, 52, 1400, 1204, 108, 52, 52, 58, 149, 327, 165, 240, 65, 265, 259, 579, 87, 102, 112, 67, 108, 59, 100, 193, 60, 118, 67, 175, 115, 159, 79, 112, 141, 108, 75, 111, 78, 53, 106, 111, 52, 143, 55, 64, 225, 156, 280, 101, 237, 100, 61, 62, 1637, 143, 105, 180, 117, 87, 101, 123, 259, 162, 63, 90, 129, 71, 60, 55, 118, 69, 524, 75, 56, 131, 59, 140, 186, 286, 350, 73, 87, 182, 103, 73, 107, 54, 194, 97, 590, 124, 206, 222, 224, 144, 382, 55, 51, 63, 93, 293, 70, 258, 109, 62, 970, 180, 240, 130, 72, 90, 281, 144, 144, 120, 193, 194, 624, 164, 107, 799, 316, 96, 57, 68, 73, 101, 203, 291, 972, 229, 216, 64, 62, 519, 330, 76, 111, 72, 114, 399, 366, 56, 58, 113, 216, 74, 69, 423, 127, 270, 235, 123, 330, 100, 383, 197, 164, 152, 53, 102, 55, 2700, 86, 92, 134, 53, 122, 152, 172, 106, 2080, 199, 102, 237, 80, 126, 253, 168, 99, 90, 573, 170, 132, 61, 74, 102, 258, 421, 327, 71, 68, 130, 210, 115, 335, 347, 415, 196, 139, 357, 339, 71, 55, 237, 278, 52, 71, 501, 147, 202, 194, 54, 60, 89, 59, 69, 89, 235, 71, 102, 135, 1090, 52, 60, 117, 80, 1141, 385, 59, 235, 255, 53, 63, 70, 121, 67, 108, 138, 145, 130, 388, 143, 127, 66, 60, 58, 99, 144, 71, 98, 124, 53, 73, 498, 55, 116, 96, 355, 69, 165, 5677, 87, 77, 57, 78, 128, 87, 364, 170, 63, 138, 55, 85, 59, 312, 198, 83, 160, 72, 216, 87, 61, 75, 77, 115, 158, 1119, 144, 182, 128, 70, 472, 135, 562, 155, 72, 61, 111, 52, 510, 394, 127, 130, 1502, 67, 453, 206, 97, 78, 143, 71, 114, 276, 237, 121, 403, 57, 155, 82, 104, 70, 54, 440, 57, 145, 108, 69, 101, 100, 60, 84, 100, 197, 79, 82, 106, 127, 102, 84, 52, 73, 68, 80, 217, 67, 91, 343, 271, 85, 55, 125, 710, 103, 110, 93, 63, 91, 212, 51, 310, 69, 142, 52, 110, 166, 117, 58, 125, 143, 99, 78, 110, 89, 350, 111, 53, 77, 82, 274, 63, 52, 139, 88, 58, 204, 103, 194, 192, 243, 58, 2379, 95, 57, 99, 86, 72, 225, 63, 519, 551, 114, 95, 94, 132, 117, 194, 302, 84, 85, 73, 53, 153, 122, 99, 192, 53, 292, 306, 82, 55, 329, 62, 382, 219, 60, 58, 286, 60, 58, 58, 157, 97, 57, 52, 77, 76, 98, 88, 188, 86, 154, 297, 125, 512, 68, 213, 70, 97, 164, 92, 160, 308, 178, 214, 185, 57, 178, 163, 672, 108, 228, 256, 83, 75, 259, 81, 702, 115, 61, 56, 899, 113, 53, 323, 57, 215, 104, 168, 51, 150, 123, 103, 77, 52, 410, 67, 77, 60, 423, 100, 185, 64, 155, 60, 167, 484, 119, 238, 52, 90, 116, 78, 155, 114, 202, 110, 78, 53, 166, 78, 171, 86, 237, 117, 55, 214, 288, 53, 118, 937, 128, 91, 69, 302, 70, 72, 173, 88, 62, 93, 293, 411, 141, 192, 61, 180, 130, 83, 267, 206, 75, 133, 98, 119, 64, 263, 301, 208, 89, 133, 72, 123, 62, 68, 115, 51, 68, 54, 273, 167, 62, 138, 97, 140, 80, 645, 191, 142, 546, 147, 461, 76, 128, 120, 129, 105, 93, 62, 86, 51, 116, 74, 150, 249, 267, 155, 143, 60, 115, 74, 76, 60, 98, 91, 98, 183, 122, 84, 176, 98, 65, 97, 113, 270, 140, 52, 552, 130, 506, 103, 218, 385, 90, 86, 212, 94, 139, 145, 182, 235, 160, 76, 101, 64, 242, 100, 1137, 55, 65, 71, 83, 312, 84, 70, 68, 121, 180, 64, 74, 102, 129, 227, 167, 51, 63, 67, 76, 57, 354, 284, 212, 117, 89, 78, 339, 117, 224, 117, 89, 130, 474, 98, 85, 125, 69, 84, 58, 162, 218, 295, 67, 134, 179, 111, 57, 98, 63, 66, 123, 84, 97, 137, 96, 134, 135, 662, 294, 51, 91, 90, 69, 123, 270, 135, 124, 258, 61, 54, 133, 67, 107, 166, 109, 118, 79, 162, 151, 69, 56, 118, 319, 319, 153, 153, 77, 92, 235, 57, 94, 109, 66, 662, 106, 81, 53, 51, 130, 76, 118, 228, 97, 111, 125, 108, 102, 59, 88, 330, 83, 210, 82, 73, 186, 60, 63, 172, 232, 54, 71, 102, 51, 369, 372, 83, 109, 132, 282, 174, 84, 63, 99, 111, 202, 135, 82, 236, 148, 182, 170, 360, 146, 53, 56, 97, 95, 136, 84, 86, 169, 113, 156, 290, 183, 77, 177, 55, 981, 251, 84, 52, 207, 460, 57, 126, 87, 57, 216, 53, 85, 62, 172, 276, 66, 96, 179, 117, 64, 152, 69, 94, 62, 118, 69, 261, 73, 208, 53, 160, 252, 114, 98, 89, 163, 277, 62, 585, 62, 60, 308, 144, 270, 123, 79, 402, 447, 624, 93, 199, 201, 225, 151, 185, 269, 660, 82, 53, 125, 191, 242, 357, 449, 69, 95, 170, 89, 706, 222, 54, 145, 255, 158, 76, 333, 60, 190, 155, 93, 320, 285, 66, 164, 76, 60, 98, 103, 67, 149, 449, 324, 86, 189, 165, 266, 116, 63, 378, 52, 128, 137, 279, 112, 159, 178, 101, 135, 203, 99, 69, 162, 125, 79, 60, 710, 208, 93, 151, 547, 101, 57, 143, 128, 327, 60, 672, 83, 209, 77, 54, 898, 53, 62, 57, 241, 305, 281, 249, 60, 86, 54, 101, 89, 87, 148, 407, 120, 129, 93, 169, 52, 74, 217, 252, 234, 153, 75, 70, 98, 102, 65, 318, 316, 92, 83, 62, 516, 99, 70, 78, 62, 296, 143, 64, 140, 174, 77, 64, 81, 52, 162, 187, 96, 115, 63, 195, 125, 74, 211, 65, 90, 418, 117, 127, 260, 134, 52, 478, 81, 67, 101, 229, 104, 144, 54, 86, 63, 80, 128, 73, 84, 61, 237, 96, 152, 57, 211, 157, 103, 274, 472, 63, 208, 69, 541, 105, 566, 400, 55, 69, 57, 87, 112, 78, 124, 127, 80, 114, 69, 94, 292, 124, 142, 111, 102, 135, 69, 51, 57, 66, 79, 53, 66, 55, 131, 473, 73, 107, 200, 543, 753, 407, 183, 87, 500, 215, 71, 59, 132, 411, 468, 111, 87, 253, 57, 69, 418, 83, 109, 51, 78, 213, 62, 92, 213, 59, 198, 82, 113, 64, 66, 269, 206, 117, 271, 328, 54, 134, 135, 135, 277, 337, 100, 61, 54, 111, 111, 215, 88, 78, 181, 82, 76, 109, 127, 52, 88, 366, 963, 105, 87, 137, 82, 73, 253, 394, 75, 145, 88, 106, 63, 152, 165, 299, 411, 440, 214, 253, 201, 166, 213, 83, 270, 55, 560, 63, 59, 237, 576, 135, 312, 100, 78, 77, 315, 123, 70, 297, 157, 51, 91, 52, 232, 259, 91, 82, 158, 86, 117, 68, 53, 110, 227, 705, 78, 304, 118, 130, 286, 256, 115, 142, 74, 55, 103, 382, 245, 274, 115, 192, 66, 165, 218, 67, 690, 97, 136, 193, 92, 741, 412, 95, 75, 57, 105, 310, 54, 53, 156, 194, 82, 67, 72, 134, 190, 58, 82, 111, 408, 104, 140, 61, 851, 141, 371, 220, 67, 61, 61, 169, 121, 56, 7847, 51, 297, 54, 199, 58, 222, 148, 102, 370, 79, 279, 145, 117, 64, 109, 67, 94, 193, 114, 58, 59, 80, 94, 696, 145, 65, 90, 77, 70, 71, 485, 249, 104, 329, 68, 85, 179, 296, 65, 146, 81, 166, 93, 58, 60, 123, 191, 112, 53, 96, 472, 121, 127, 360, 137, 470, 73, 142, 227, 127, 73, 89, 70, 213, 108, 431, 444, 378, 74, 1279, 364, 196, 56, 70, 159, 61, 221, 140, 80, 131, 54, 189, 74, 97, 90, 119, 71, 68, 141, 159, 68, 200, 134, 114, 64, 272, 271, 242, 164, 86, 124, 104, 61, 88, 104, 78, 175, 98, 118, 134, 61, 166, 756, 70]

In [120]:
orders.head(3)

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 8:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 8:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 8:26:00,2.75,17850,United Kingdom,22.00

#### Select orders from Spain that include more than 50 items.

In [147]:
# your code here
spain_orders = orders.groupby("InvoiceNo").agg({'StockCode':'count'})
spain_50 = spain_orders[spain_orders['StockCode'] > 50]
print(spain_50)
print('')
print("The list of orders from spain who have more than 50 items is: ",  list(spain_50["StockCode"]))

           StockCode
InvoiceNo
536401            64
536409            58
536412            81
536415            59
536464            85
...              ...
581414            71
581425            88
581433            72
581476            65
581538            74

[1653 rows x 1 columns]

The list of orders from spain who have more than 50 items is:  [64, 58, 81, 59, 85, 71, 54, 57, 73, 65, 67, 67, 63, 65, 121, 76, 69, 66, 71, 53, 73, 52, 51, 51, 63, 118, 55, 117, 66, 105, 64, 57, 86, 70, 66, 69, 169, 64, 59, 56, 60, 58, 52, 87, 58, 53, 60, 51, 59, 80, 53, 66, 69, 161, 60, 53, 86, 74, 74, 60, 66, 65, 87, 62, 55, 51, 68, 70, 51, 62, 54, 56, 118, 58, 53, 137, 57, 56, 54, 53, 52, 64, 62, 59, 83, 89, 88, 55, 67, 54, 73, 61, 67, 67, 61, 54, 86, 62, 58, 54, 54, 65, 89, 58, 71, 57, 51, 54, 52, 54, 157, 53, 104, 74, 57, 69, 171, 149, 52, 98, 131, 52, 93, 93, 77, 54, 56, 53, 52, 71, 88, 66, 70, 79, 64, 76, 67, 76, 100, 53, 53, 61, 62, 51, 99, 68, 101, 103, 57, 72, 59, 106, 106, 52, 93, 73, 62, 51, 103, 95, 53, 67, 53, 56, 52, 137, 76, 110, 52, 91, 93, 57, 83, 73, 61, 54, 65, 54, 94, 77, 58, 79, 56, 115, 71, 259, 55, 71, 63, 51, 61, 131, 103, 57, 80, 85, 70, 52, 61, 68, 84, 64, 52, 84, 71, 62, 65, 53, 76, 61, 69, 51, 51, 110, 70, 96, 65, 74, 61, 58, 53, 58, 63, 59, 109, 51, 67, 53, 68, 92, 73, 69, 76, 78, 63, 120, 62, 118, 64, 78, 52, 68, 83, 58, 131, 67, 56, 52, 52, 68, 64, 66, 63, 67, 72, 131, 95, 98, 61, 51, 69, 66, 80, 82, 98, 52, 60, 56, 86, 52, 58, 59, 73, 61, 110, 87, 65, 68, 59, 51, 90, 164, 59, 51, 56, 117, 54, 70, 82, 58, 54, 53, 81, 55, 51, 60, 71, 52, 62, 60, 63, 51, 96, 74, 85, 67, 82, 108, 53, 102, 96, 51, 66, 62, 61, 54, 70, 65, 294, 63, 51, 67, 82, 79, 58, 68, 155, 68, 85, 58, 68, 64, 92, 55, 56, 67, 114, 73, 76, 76, 63, 51, 58, 74, 62, 95, 90, 51, 69, 60, 70, 118, 60, 89, 53, 54, 52, 52, 64, 76, 51, 68, 54, 56, 58, 63, 55, 65, 57, 127, 75, 67, 89, 60, 95, 91, 70, 157, 68, 67, 58, 54, 67, 52, 52, 96, 95, 67, 61, 65, 54, 61, 83, 57, 58, 57, 65, 56, 53, 63, 59, 57, 61, 77, 141, 86, 70, 60, 56, 71, 54, 52, 54, 53, 56, 57, 54, 74, 93, 64, 89, 99, 64, 55, 52, 63, 92, 109, 56, 51, 59, 65, 55, 130, 53, 71, 81, 54, 59, 58, 56, 127, 56, 55, 79, 65, 61, 63, 62, 64, 67, 128, 85, 60, 63, 68, 59, 81, 54, 57, 58, 62, 64, 103, 94, 176, 60, 57, 74, 66, 145, 79, 62, 60, 71, 55, 65, 57, 51, 54, 61, 75, 51, 62, 58, 92, 67, 54, 60, 96, 76, 125, 51, 80, 58, 60, 104, 60, 80, 59, 52, 55, 70, 93, 53, 73, 51, 64, 60, 98, 57, 53, 54, 63, 58, 53, 264, 76, 53, 78, 54, 52, 143, 80, 91, 53, 54, 66, 79, 67, 75, 51, 52, 57, 54, 52, 76, 56, 71, 93, 76, 60, 105, 84, 80, 134, 68, 55, 51, 76, 105, 76, 55, 60, 61, 86, 98, 121, 105, 75, 54, 57, 56, 66, 99, 55, 60, 64, 56, 64, 77, 81, 205, 57, 63, 56, 76, 61, 68, 70, 80, 75, 52, 51, 55, 54, 102, 55, 79, 99, 99, 51, 56, 71, 138, 51, 61, 65, 68, 69, 80, 51, 98, 81, 64, 52, 58, 51, 85, 57, 59, 85, 83, 95, 62, 83, 69, 90, 75, 66, 65, 67, 82, 103, 80, 51, 65, 67, 87, 93, 71, 126, 54, 83, 107, 78, 72, 66, 81, 57, 58, 88, 57, 53, 82, 81, 55, 66, 51, 53, 52, 56, 77, 52, 72, 60, 87, 93, 67, 86, 60, 53, 69, 52, 64, 77, 80, 69, 67, 75, 77, 58, 67, 70, 55, 94, 60, 52, 55, 132, 57, 87, 54, 60, 68, 56, 72, 51, 53, 158, 82, 56, 60, 70, 58, 105, 67, 92, 75, 117, 63, 51, 69, 60, 68, 53, 57, 178, 57, 84, 76, 72, 90, 55, 70, 95, 51, 65, 99, 68, 101, 71, 53, 74, 52, 55, 114, 58, 102, 58, 62, 70, 89, 53, 83, 51, 52, 61, 80, 60, 51, 188, 59, 81, 63, 65, 84, 277, 219, 93, 57, 51, 65, 66, 78, 52, 69, 55, 57, 97, 54, 94, 54, 60, 103, 121, 147, 87, 56, 110, 58, 89, 58, 78, 168, 87, 57, 89, 96, 62, 88, 57, 84, 61, 69, 119, 62, 52, 71, 62, 60, 94, 85, 54, 75, 87, 166, 119, 70, 64, 171, 97, 86, 76, 54, 61, 127, 64, 125, 128, 55, 73, 58, 79, 56, 118, 103, 55, 51, 85, 57, 78, 53, 56, 73, 81, 52, 105, 153, 74, 85, 92, 69, 57, 68, 77, 127, 74, 94, 122, 72, 90, 67, 71, 69, 87, 81, 179, 60, 51, 65, 58, 55, 70, 81, 68, 90, 63, 55, 51, 150, 63, 55, 64, 72, 58, 138, 85, 67, 67, 64, 51, 58, 81, 61, 52, 67, 55, 52, 81, 52, 74, 57, 61, 85, 59, 74, 73, 51, 139, 217, 109, 59, 93, 130, 54, 141, 67, 146, 57, 72, 98, 70, 75, 107, 77, 64, 54, 63, 78, 64, 52, 56, 54, 109, 57, 116, 63, 58, 79, 64, 60, 113, 65, 53, 399, 119, 54, 84, 66, 51, 53, 58, 100, 64, 91, 68, 57, 85, 57, 421, 58, 79, 75, 111, 77, 87, 84, 52, 85, 53, 66, 87, 74, 127, 58, 75, 80, 51, 120, 53, 61, 53, 114, 89, 106, 64, 85, 335, 58, 124, 54, 101, 54, 68, 92, 68, 92, 75, 73, 53, 141, 68, 62, 148, 51, 85, 54, 51, 57, 67, 70, 57, 62, 74, 76, 69, 61, 70, 101, 52, 77, 63, 59, 163, 54, 75, 73, 67, 135, 65, 90, 66, 285, 62, 106, 51, 53, 77, 57, 75, 63, 52, 70, 61, 125, 83, 56, 93, 65, 140, 74, 84, 52, 113, 62, 89, 81, 68, 100, 115, 128, 64, 69, 104, 62, 127, 182, 60, 239, 58, 75, 58, 51, 61, 66, 80, 69, 53, 54, 53, 53, 114, 87, 84, 85, 56, 55, 53, 59, 60, 53, 52, 56, 56, 78, 56, 76, 73, 57, 56, 83, 66, 99, 138, 83, 101, 72, 76, 353, 55, 62, 90, 57, 259, 60, 68, 58, 133, 53, 61, 51, 105, 58, 138, 112, 131, 79, 55, 100, 87, 76, 54, 57, 68, 63, 80, 52, 65, 96, 79, 79, 75, 99, 74, 55, 88, 364, 89, 53, 53, 89, 85, 65, 55, 202, 52, 61, 65, 119, 91, 125, 55, 54, 66, 56, 58, 63, 80, 75, 75, 59, 94, 59, 158, 144, 70, 84, 51, 56, 52, 125, 76, 54, 95, 54, 100, 52, 69, 223, 73, 61, 81, 76, 75, 62, 77, 83, 129, 85, 105, 61, 150, 51, 84, 107, 73, 89, 97, 126, 65, 72, 352, 85, 66, 105, 76, 130, 154, 68, 53, 57, 51, 54, 178, 61, 55, 105, 58, 89, 54, 69, 53, 53, 63, 53, 137, 61, 62, 74, 70, 62, 157, 85, 56, 53, 74, 57, 144, 63, 79, 130, 52, 63, 116, 109, 61, 52, 57, 67, 61, 91, 72, 98, 66, 102, 67, 65, 62, 52, 435, 51, 57, 146, 78, 156, 52, 87, 93, 96, 55, 65, 87, 52, 53, 58, 63, 90, 53, 79, 208, 56, 57, 67, 191, 58, 135, 73, 113, 112, 63, 58, 54, 61, 71, 91, 64, 66, 102, 56, 63, 89, 67, 95, 55, 58, 160, 64, 78, 58, 70, 151, 73, 75, 98, 66, 57, 72, 131, 110, 76, 61, 91, 58, 58, 57, 62, 69, 73, 130, 98, 82, 140, 57, 66, 76, 60, 70, 59, 84, 189, 53, 68, 116, 86, 147, 377, 52, 60, 59, 60, 52, 87, 80, 91, 58, 65, 80, 55, 76, 60, 84, 100, 52, 76, 92, 55, 83, 52, 60, 90, 51, 106, 84, 65, 69, 71, 83, 51, 105, 59, 70, 88, 93, 131, 96, 57, 82, 73, 74, 68, 80, 65, 77, 90, 58, 61, 53, 55, 86, 542, 87, 124, 62, 52, 60, 60, 94, 128, 57, 57, 79, 82, 92, 145, 93, 92, 51, 64, 82, 133, 57, 92, 83, 61, 61, 81, 55, 79, 72, 55, 91, 62, 59, 64, 51, 154, 112, 53, 65, 122, 56, 66, 87, 100, 68, 64, 88, 52, 66, 61, 58, 67, 94, 66, 55, 84, 147, 56, 65, 57, 56, 198, 86, 58, 52, 66, 51, 78, 71, 55, 93, 94, 73, 52, 63, 79, 60, 72, 93, 56, 65, 85, 53, 63, 58, 63, 109, 72, 61, 62, 78, 184, 51, 119, 77, 128, 106, 51, 51, 59, 212, 78, 102, 60, 107, 442, 136, 72, 132, 53, 54, 59, 58, 54, 66, 55, 91, 55, 67, 126, 52, 60, 55, 66, 97, 56, 70, 125, 127, 52, 87, 68, 59, 107, 82, 52, 148, 85, 75, 52, 69, 65, 64, 109, 77, 51, 85, 64, 59, 54, 100, 92, 100, 105, 59, 51, 63, 55, 53, 91, 52, 51, 76, 52, 83, 164, 533, 88, 105, 96, 74, 126, 194, 126, 64, 158, 60, 112, 57, 52, 68, 68, 68, 68, 147, 73, 69, 51, 83, 61, 125, 87, 57, 80, 95, 53, 53, 127, 55, 55, 139, 100, 73, 60, 73, 82, 77, 117, 65, 127, 64, 115, 53, 108, 78, 143, 88, 57, 92, 72, 83, 71, 121, 115, 68, 529, 51, 61, 80, 64, 126, 68, 64, 184, 55, 61, 71, 63, 52, 51, 69, 120, 77, 57, 81, 77, 59, 53, 55, 57, 72, 133, 54, 52, 63, 183, 115, 71, 88, 72, 65, 74]

#### Select all free orders.

In [154]:
# your code here
orders[(orders["InvoiceNo"]) & (orders["amount_spent"] == 0)]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
6914,9302,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Germany,0.0
22539,33576,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,United Kingdom,0.0
34494,56674,541109,22168,2011,1,4,15,organiser wood antique white,1,2011-01-13 15:10:00,0.0,15107,United Kingdom,0.0
53788,86789,543599,84535B,2011,2,4,13,fairy cakes notebook a6 size,16,2011-02-10 13:08:00,0.0,17560,United Kingdom,0.0
85671,130188,547417,22062,2011,3,3,10,ceramic bowl with love heart design,36,2011-03-23 10:25:00,0.0,13239,United Kingdom,0.0
97430,145208,548871,22162,2011,4,1,14,heart garland rustic padded,2,2011-04-04 14:42:00,0.0,14410,United Kingdom,0.0
137127,198383,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Australia,0.0
197173,282912,561669,22960,2011,7,4,17,jam making set with jars,11,2011-07-28 17:09:00,0.0,12507,Spain,0.0
208950,298054,562973,23157,2011,8,4,11,set of 6 nativity magnets,240,2011-08-11 11:42:00,0.0,14911,EIRE,0.0
223931,314745,564651,23270,2011,8,5,14,set of 2 ceramic painted hearts,96,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223932,314746,564651,23268,2011,8,5,14,set of 2 ceramic christmas reindeer,192,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223933,314747,564651,22955,2011,8,5,14,36 foil star cake cases,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
223934,314748,564651,21786,2011,8,5,14,polkadot rain hat,144,2011-08-26 14:19:00,0.0,14646,Netherlands,0.0
286507,395529,571035,M,2011,10,4,12,manual,1,2011-10-13 12:50:00,0.0,12446,RSA,0.0
307092,420404,572893,21208,2011,10,3,14,pastel colour honeycomb fan,5,2011-10-26 14:36:00,0.0,18059,United Kingdom,0.0
320049,436597,574175,22065,2011,11,4,11,christmas pudding trinket pot,12,2011-11-03 11:47:00,0.0,14110,United Kingdom,0.0
322279,439361,574469,22385,2011,11,5,11,jumbo bag spaceboy design,12,2011-11-04 11:55:00,0.0,12431,Australia,0.0
328385,446125,574879,22625,2011,11,1,13,red kitchen scales,2,2011-11-07 13:22:00,0.0,13014,United Kingdom,0.0
334242,454463,575579,22437,2011,11,4,11,set of 9 black skull balloons,20,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
334243,454464,575579,22089,2011,11,4,11,paper bunting vintage paisley,24,2011-11-10 11:49:00,0.0,13081,United Kingdom,0.0
352746,479079,577129,22464,2011,11,4,19,hanging metal heart lantern,4,2011-11-17 19:52:00,0.0,15602,United Kingdom,0.0
370473,502122,578841,84826,2011,11,5,15,asstd design 3d paper stickers,12540,2011-11-25 15:57:00,0.0,13256,United Kingdom,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [151]:
# your code here
#orders[(orders["InvoiceNo"]) & (orders["Description"] == 0)]

orders.loc[orders["Description"].str.startswith('lunch bag', na=False)]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 9:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 9:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 9:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [161]:
# your code here
lunch_bag = orders.loc[orders["Description"].str.startswith('lunch bag', na=False)]
lunch_bag[lunch_bag["year"] == 2011]
#Or we can select the year working using InvoiceDate:
#lunch_bag_19 = lunch_bag.loc[lunch_bag["InvoiceDate"].str.startswith('2011', na=False)]
#lunch_bag_19

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,42678,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,42679,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,42851,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,42852,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,43616,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 9:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Show the frequency distribution of the amount spent in Spain.

In [166]:
# your code here
frequency = orders[(orders["Country"] == "Spain")]["amount_spent"].value_counts()
freq_table = pd.DataFrame(frequency)
freq_table = freq_table.rename(columns = {'amount_spent':'freq'})
freq_table

        freq
15.00    186
17.70    122
19.80     99
17.40     86
10.20     76
...      ...
2.60       1
5.85       1
27.00      1
41.60      1
109.50     1

[309 rows x 1 columns]

# JUST RELAISED THAT WE NEED TO DO ONE CHALLENGE :)

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here